app/views/links/show.html.erb

SELECT "statistics".* FROM "statistics" WHERE "statistics"."link_id" = ?  [["link_id", 25]]
---
<tbody>
 <% @link.statistics.each do |stat|  %>