app/controllers/links_controller.rb

  def create_url
    if exists
      flash[:error] = "Custom URL already exists"
    else
      link = Link.create!(link_params)

      link.user_id = current_user.id if current_user
      link.save
---
INSERT INTO "links" ("actual_url", "vanity", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["actual_url", "facebook.com"], ["vanity", ""], ["created_at", "2016-03-30 18:11:20.340916"], ["updated_at", "2016-03-30 18:11:20.340916"]]
UPDATE "links" SET "actual_url" = ?, "vanity" = ?, "created_at" = ?, "updated_at" = ?, "id" = ?, "short_url" = ? WHERE "links"."id" = ?  [["actual_url", "http://facebook.com"], ["vanity", ""], ["created_at", "2016-03-30 18:11:20.340916"], ["updated_at", "2016-03-30 18:11:20.340916"], ["id", 1], ["short_url", "1"], ["id", 1]]

  def handle_short_url
    @link = Link.find_by(short_url: params[:short_url])
---
SELECT  "links".* FROM "links" WHERE "links"."short_url" = ? LIMIT 1  [["short_url", "facebook"]]

  def show
    @link = Link.find_by(id: params[:id])
---
SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", 25]]

  def edit
    @link = Link.find_by(id: params[:id])
---
SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", 52]]

  def update
    link = Link.find_by(id: params[:id])
    link.update(actual_url: params[:actual_url], active: active_to_bool(params[:active]))
---
SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", 53]]
UPDATE "links" SET "actual_url" = ?, "updated_at" = ? WHERE "links"."id" = ?  [["actual_url", "google.com"], ["updated_at", "2016-03-31 19:22:44.866719"], ["id", 1]]