app/controllers/page_controller.rb

  def index
    @popular_links = Link.order(visits: :desc).limit(5)
    flash[:anoymus_links] = Link.order(id: :desc).limit(5)
    @top_users = User.order(link_count: :desc).limit(5)
---
SELECT  "links".* FROM "links"  ORDER BY "links"."visits" DESC LIMIT 5
SELECT  "links".* FROM "links"  ORDER BY "links"."id" DESC LIMIT 5
SELECT  "users".* FROM "users"  ORDER BY "users"."link_count" DESC LIMIT 5

  def dashboard
    flash[:recent_links] = Link.retrieve(current_user.id).order(id: :desc).limit(5)
---
SELECT  "links".* FROM "links" WHERE (user_id = 1)  ORDER BY "links"."id" DESC LIMIT 5